<template>
  <b-container>
    <b-row>
      <b-col>
        <h1>
          THE iDOLM@STER ShinyColors フェス計算機 (β)
        </h1>
        <p><a href="/">計算ページに戻る</a></p>
      </b-col>
    </b-row>
    <br />
    <div>
      <b-tabs variant="success" content-class="mt-3" pills justified>
        <b-tab title="使い方" active>
          <b-row>
            <b-col>
              <h2>1. フェスユニット情報の入力</h2>
              <p>
                フェスのアピール値を計算する前に、アピール値を計算したいユニットの情報を入力します。
                入力画面に表示されている例を入力した場合、以下の図のようになります。
              </p>
              <img
                src="/images/usage01.jpg"
                class="img-fluid"
                alt="ユニット情報入力の具体例"
              />
              <br />
              <p>
                同様に、各アイドルの思い出レベルも入力します。
                すると、フェスユニットの総合値が算出されるので、これが自分のゲーム画面で表示されているものと一致しているかを確かめてください。
                ここが一致している場合、正しく情報が入力されています。
              </p>
              <img
                src="/images/usage02.jpg"
                class="img-fluid"
                alt="入力内容確認の具体例"
              />
              <br />
              <p>
                続いて、G.R.A.D.編で育てたアイドルで、全体に効果があるアビリティを取得している場合、
                <span class="bold">
                  ユニット全体で有効になっている数値
                </span>
                をそれぞれ入力してください。 唯一、思い出増加量が変化する
                "思い出- (G.R.A.D.)", "思い出+(G.R.A.D.)", "思い出++(G.R.A.D.)"
                についてはそれらの増加量合計値を入力してください。
              </p>
              <p>
                また、注目度が変化する "人気者", "ひかえめ" は
                <span class="bold">
                  フェスに参加している全てのユニットの値が反映されます。
                </span>
                ただし、フェスの開始時点でこの情報を知る術はないため、基本的には自分のユニット内での取得個数(0〜5)を入力してください。
                <span class="bold">
                  全体的に計算結果が大きくずれる場合、自分以外のユニットの中に
                  "人気者", "ひかえめ" を所持するフェスアイドルが存在します。
                </span>
              </p>
              <br />
              <p>
                これらの入力した情報は、ページを閉じたり、リロードすると消えてしまいます。
                しかし、これらの情報はセーブスロットに保存することができます。
                情報入力後、好きなセーブスロットを選び、好きな名前を付けて
                "名前を付けて保存" ボタンを押すことで、
                入力内容を保存することができます。
                必要に応じて、入力内容を保存した後、ページの一番上まで戻ってください。
                (準備してあるボタンも利用可能です)
              </p>
              <img
                src="/images/usage03.jpg"
                class="img-fluid"
                alt="入力情報の保存"
              />
              <br />
              <p>
                保存した内容は、フェスユニット入力の上にあるボタンでロードすることができます。
              </p>
              <img
                src="/images/usage04.jpg"
                class="img-fluid"
                alt="入力情報の読み込み"
              />
              <br />
              <p>
                この情報はあなたのパソコン（ブラウザ）の中に保存されます。
                そのため、キャッシュをクリアしたり、別のブラウザで見るような場合、保存したデータは失われることに注意してください。
              </p>
              <br />
              <p>
                以上でフェスユニット入力の準備は終了です。
              </p>
            </b-col>
          </b-row>
          <br />
          <b-row>
            <b-col>
              <h2>2. 直接アピール値の計算</h2>
              <p>
                ユニット情報を入力した後、"アピール値計算"
                のタブを開いてください。
                こちらで実際のアピール値の計算を行います。
              </p>
              <p>
                ここでの説明は手動で各種パラメータを組み立てていくため比較的自由な計算を行えます。
                一方、アピールごとの「アピール本体」「追撃」「バフ」「LINKアピール」を同タイミングで計算するためには
                次の章で説明する「アピールテンプレート」を登録する必要があります。
              </p>
              <br />
              <p>
                フェスが始まると毎回異なる思い出ゲージでの開始となります。
                グレードフェスの場合、５種類の顔（紫、青、緑、黄色、赤）で示される通り、パターンは５種類です。
                そのため、グレードフェスの準備でテンションチェック終了後、
                あるいはフェスリハーサルの思い出ゲージの初期値で状態を初期化します。
                適切なテンションを選び、ターンの初期化ボタンを押します。
                すると、思い出ゲージとメンタルが初期化されます。
              </p>
              <img
                src="/images/usage05.jpg"
                class="img-fluid"
                alt="ターンの初期化直後"
              />
              <br />
              <p>
                次に、ターンが始まると、パッシブスキルがランダムに発動し、アピールにバフ(増加効果)が得られます。
                また、前ターンから引き継ぎの効果(アイコン)がある場合、こちらでも同様にバフが得られます。
                これらを画面に入力します。
                そして、実際に行うアピールの倍率を入力します。
              </p>
              <p>
                具体例として、２ターン目、思い出ゲージ48.5 (30開始 + 15 x
                1.25追加) の状態で、 以下の図のような効果(Vo,
                Viにそれぞれ+15%のバフ)があり、 「ほわっとスマイル＋（Vo3倍 +
                Vi3倍)」をアピールする場合を考えてみます。
                また、図から分かるとおり、Voに77%,
                Viに70%のパッシブスキルによるバフがかかっています。
              </p>
              <div class="text-center">
                <img
                  src="/images/usage06.jpg"
                  class="img-fluid"
                  alt="現在有効な効果一覧"
                />
                <img
                  src="/images/usage07.jpg"
                  class="img-fluid"
                  alt="実施する予定のアピール"
                />
              </div>
              <br />
              <p>
                この時、シミュレーターに以下の図のような入力を行います。
                なお、ここでは真乃のポジションは上の図にあるとおり "Vocal担当"
                で、 実施するアピールは "Perfect"
                としてアピールした場合のアピール値計算を行いたいものとします。
              </p>
              <img
                src="/images/usage08.jpg"
                class="img-fluid"
                alt="入力の具体例"
              />
              <br />
              <p>
                今回のDanceアピールのように、実施されないアピールについてはアピール倍率を0のままにしておいてください。
              </p>
              <p>
                この時、以下のように各審査員に対してアピールを行った時の計算結果が得られます。
              </p>
              <img
                src="/images/usage09.jpg"
                class="img-fluid"
                alt="シミュレーション結果"
              />
              <br />
              <p>
                この状態でVocal審査員にアピールした実際の結果は以下の通りです
                (まだβ版で完全な計算式が得られていないため、若干のズレがあります)。
              </p>
              <img
                src="/images/usage10.jpg"
                class="img-fluid"
                alt="実際の結果(誤差あり)"
              />
              <br />
              <p>
                なお、シミュレーション結果からも分かるように、
                G.R.A.D.のアビリティバフが実装以前と比較すると破格の効果を及ぼしていることがわかります。
              </p>
              <p>
                以上の方法で、適切にアピール時の状況を入力することでフェスでのアピール時の計算結果を事前にシミュレーションできます。
                ターン経過時の思い出増加量自動計算などの機能もありますので、こちらもご利用ください。
                (G.R.A.D.バフを算出するには、現在ターン数や現在の思い出ゲージの正確な値が必要になるためです)
              </p>
            </b-col>
          </b-row>
          <br />
          <b-row>
            <b-col>
              <h2>3. アピールテンプレートを利用した計算</h2>
              <p>
                アピールテンプレートを利用することで、
                「追撃」「アピール後バフ」「LINKアピール」「思い出」などを効率よく計算できます。
              </p>
              <p>
                ユニット情報タブの「アピールテンプレート登録」から自分の計算で使う値を入力します。
              </p>
              <p>
                以下はpSSR【ちょっとあげる〜】和泉
                愛依のアピール「ちょっとあげる〜」
                （Vocal3倍アピール/全ユニットのVisual10%UP/Visual5%UP, LINK:
                Vocal 0.6〜3倍アピール [消去: DanceUP]) を入力したものです。
              </p>
              <img
                src="/images/usage11.jpg"
                class="img-fluid"
                alt="アピールテンプレート入力例1"
              />
              <br />
              <p>
                また、以下はpSSR【空と青とアイツ】芹沢
                あさひの思い出アピール(Lv.MAX)
                （思い出アピール[Lv.5]/Vocal&amp;Dance&amp;Visual10%UP, LINK:
                全観客にVisual 0.5〜2.5倍アピール [消去: VocalUP&amp;DanceUP]/
                LINK: 全観客にVisual 0.7〜3.5倍アピール [消去: VisualUP])
                を入力したものです。
              </p>
              <img
                src="/images/usage12.jpg"
                class="img-fluid"
                alt="アピールテンプレート入力例2"
              />
              <br />
              <p>
                これらの情報を入力した後、右下の "追加"
                ボタンを押すことでテンプレートを追加できます。
                必要に応じて、テンプレートを追加・読み込み・削除してください。
              </p>
              <p>
                ここで追加したテンプレートはアピール値計算に利用できるようになります。
                アピール値計算の「アピールテンプレート」から選択できます。
                上記で登録した「ちょっとあげる〜」を選択した場合、以下のようになり、
                アピール倍率などが自動計算されます。
                このアピールの計算には「バフ個数」が必要となるため、
                計算モードを詳細として、バフの個数を入力可能としています。
              </p>
              <img
                src="/images/usage13.jpg"
                class="img-fluid"
                alt="アピールテンプレート計算例1"
              />
              <br />
              <p>
                なお、思い出アピールのテンプレートを選択した場合、
                思い出ゲージが100に、アピールがPerfectに、それぞれ自動的にセットされます。
              </p>
            </b-col>
          </b-row>
        </b-tab>
        <b-tab title="更新履歴・計算式など">
          <b-row>
            <b-col>
              <h2>主な更新履歴</h2>
              <ul>
                <li>
                  2020/08/08 -
                  注目度DOWNのアビリティ名称を正しい「ひかえめ」に修正 (thx
                  feedback!)
                </li>
                <li>
                  2020/07/07 -
                  ユニット表記の算出式が正しくない場合がある点の修正 (thx
                  feedback!)
                </li>
                <li>2020/06/22 - アピールテンプレート機能を実装</li>
                <li>2020/06/09 - 初版公開</li>
              </ul>
            </b-col>
          </b-row>
          <b-row>
            <b-col>
              <h2>このページの紹介について</h2>
              <ul>
                <li>
                  このページの紹介（リンクを貼る、機能紹介など）は自由に行って貰っても構いません。
                </li>
                <li>
                  ただし、このページで利用（引用）しているゲーム画像の
                  著作権、及びその他知的財産権は当該サービスの提供元に帰属しますので
                  その点のみ注意してください。
                </li>
                <li>もしよければ作者まで報告を頂けると喜びます</li>
              </ul>
            </b-col>
          </b-row>

          <b-row>
            <b-col>
              <h2>利用中の計算式</h2>
              <h3>アピール値算出式</h3>
              <ul>
                <li>
                  フェスアピール基礎値 = 2.0 *
                  アピールするアイドルの該当ステータス + 0.5 *
                  (アピールしないアイドルの該当ステータス合計)
                </li>
                <li>
                  基礎係数 = INT(フェスアピール基礎値 * (1 +
                  該当属性バフ合計値(%)/100 + アビリティバフ合計値(%)/100) *
                  アピール係数)
                </li>
                <li>
                  興味値補正 = 1 * nΠi(1 + 興味UP(%)の項目i/100) * nΠi(1 -
                  興味DOWN(%)の項目i/100)
                  <ul>
                    <li>
                      興味値は個別の値の総乗(nΠi)を取る。
                      具体的には、50%ダウンと30%ダウンが同時に付いている場合は 1
                      * 0.5 * 0.7 = 0.35 となる
                    </li>
                  </ul>
                </li>
                <li>
                  フェスアピール値 = INT(INT(基礎係数 * アピール倍率) *
                  Excellent係数 * 興味値補正)
                </li>
                <li>
                  アピール係数はPerfectなら1.5, Goodなら1.1, Normarlなら1.0,
                  Badなら0.5
                </li>
                <li>
                  Excellent係数はアピール属性と審査員属性が一致した場合2,
                  一致しない場合は1
                </li>
              </ul>
              <h3>単独アビリティバフ算出式</h3>
              <ul>
                <li>
                  スタートダッシュ(%): MAX(10 - (8/9 * (現在ターン数 - 1)), 2)
                </li>
                <li>
                  スロースタート(%): MIN(4 + (16/9 * (現在ターン数 - 1)), 20)
                </li>
                <li>
                  アピールアップ(思い出高) (%): 2 + (思い出ゲージ / 100) * 8
                </li>
                <li>
                  アピールアップ(思い出低) (%): 4 + (1 - 思い出ゲージ / 100) *
                  16
                </li>
              </ul>
              <h3>各種アピール倍率計算式</h3>
              <ul>
                <li>
                  メンタルが多いほど効果UP (渾身): 最大倍率 * MAX(0.2, 1.6 *
                  残メンタル割合 - 0.6)
                  <ul>
                    <li>メンタル100%で最大倍率</li>
                    <li>メンタル50%以下で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  メンタルが少ないほど効果UP (背水): 最大倍率 * (1 - 0.8 *
                  残メンタル割合)
                  <ul>
                    <li>メンタル0%で最大倍率 (=実際には最大値は出ない)</li>
                    <li>メンタル100%で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  思い出ゲージが多いほど効果UP: 最大倍率 * (0.8 *
                  思い出ゲージ割合 + 0.2)
                  <ul>
                    <li>思い出ゲージ100で最大倍率</li>
                    <li>思い出ゲージ0で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  注目度が高いほど効果アップ: 最大倍率 * (0.4 * MAX(0,
                  MIN(注目度(%)/100, 2)) + 0.2)
                  <ul>
                    <li>注目度200%以上で最大倍率</li>
                    <li>注目度0%以下で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  注目度が低いほど効果アップ: 最大倍率 * (-0.8 * MAX(-0.5,
                  MIN(注目度(%)/100, 0.5)) + 0.6)
                  <ul>
                    <li>注目度-50%以下で最大倍率</li>
                    <li>注目度50%以上で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  消去:UPが多いほど効果UP: 最大倍率 * (0.2 * MIN(5, バフ個数 +
                  1))
                  <ul>
                    <li>付与バフ4個以上で最大倍率</li>
                    <li>付与バフ0個で最低倍率(20%)</li>
                  </ul>
                </li>
                <li>
                  消去:DOWNが多いほど効果UP: 最大倍率 * (0.2 * MIN(5, デバフ個数
                  + 1))
                  <ul>
                    <li>付与デバフ4個以上で最大倍率</li>
                    <li>付与デバフ0個で最低倍率(20%)</li>
                  </ul>
                </li>
              </ul>
              <h3>アピール計算順序</h3>
              <ul>
                <li>
                  アピールにバフ効果・興味値・ユニット数値の変動がある場合、
                  そのアピールに表記されているアピールにはこのバフは効果がない
                </li>
                <li>
                  ただし、アピールで付与された効果や結果は
                  直後のLINKアピールのアピール値算出には影響する
                </li>
                <li>
                  思い出アピールの場合も同様
                  <ul>
                    <li>
                      例: アピール内でメンタルが回復した場合、
                      アピール内の渾身(メンタル割合でアピール数値が変わる)の
                      アピール値算出には利用されないが、
                      LINKアピール内の渾身のアピール値算出には利用される
                    </li>
                  </ul>
                </li>
              </ul>
            </b-col>
          </b-row>
        </b-tab>
      </b-tabs>
      <br />
      <b-row>
        <b-col>
          <a
            href="https://twitter.com/share?ref_src=twsrc%5Etfw"
            class="twitter-share-button"
            data-text="シャニマス フェス計算機 - "
            data-url="https://kind-agnesi-553039.netlify.app/"
            data-lang="ja"
            data-show-count="false"
          >
            Tweet
          </a>
          <script
            async
            src="https://platform.twitter.com/widgets.js"
            charset="utf-8"
          ></script>
        </b-col>
      </b-row>

      <b-row>
        <b-col>
          <p>
            このページの情報の正当性は一切保証されません。
            また、ページ内の情報を利用したことによって生じた一切の不利益に対してページの製作者は責を負いません。
          </p>
          <p>
            ©BANDAI NAMCO Entertinment Inc. ©BXD Inc.<br />
            当ページ上で用いるゲーム画像の著作権、及びその他知的財産権は
            当該サービスの提供元に帰属します。
          </p>
          <p>
            コンタクト(バグ報告, 改善要望,
            サービス提供元からの画像削除依頼など)は
            <a href="https://forms.gle/XH1UKV3uaSU98tz58" target="_blank">
              問い合わせ用Google Form
            </a>
            から。
          </p>
          <p>
            Developed by
            <a href="https://twitter.com/m_kigirai" target="_blank">
              Twitter: @m_kigirai
            </a>
            with
            <a
              href="https://github.com/m-kigirai/shinymas-fes-simulator-site"
              target="_blank"
            >
              Github
            </a>
          </p>
        </b-col>
      </b-row>
    </div>
  </b-container>
</template>

<script>
export default {};
</script>

<style>
.img-fluid {
  padding-bottom: 0.5em;
}
</style>
