<template>
  <b-container>
    <b-row>
      <b-col>
        <h1>
          THE iDOLM@STER ShinyColors フェス計算機 (β)
        </h1>
        <p><a href="/">計算ページに戻る</a></p>
      </b-col>
    </b-row>
    <br />
    <div>
      <b-tabs variant="success" content-class="mt-3" pills justified>
        <b-tab title="使い方" active>
          <b-row>
            <b-col>
              <h2>1. フェスユニット情報の入力</h2>
              <p>
                フェスのアピール値を計算する前に、アピール値を計算したいユニットの情報を入力します。
                入力画面に表示されている例を入力した場合、以下の図のようになります。
              </p>
              <img
                src="/images/usage01.jpg"
                class="img-fluid"
                alt="ユニット情報入力の具体例"
              />
              <br />
              <p>
                同様に、各アイドルの思い出レベルも入力します。
                すると、フェスユニットの総合値が算出されるので、これが自分のゲーム画面で表示されているものと一致しているかを確かめてください。
                ここが一致している場合、正しく情報が入力されています。
              </p>
              <img
                src="/images/usage02.jpg"
                class="img-fluid"
                alt="入力内容確認の具体例"
              />
              <br />
              <p>
                続いて、G.R.A.D.編で育てたアイドルで、全体に効果があるアビリティを取得している場合、
                <span class="bold">
                  ユニット全体で有効になっている数値
                </span>
                をそれぞれ入力してください。 唯一、思い出増加量が変化する
                "思い出- (G.R.A.D.)", "思い出+(G.R.A.D.)", "思い出++(G.R.A.D.)"
                についてはそれらの増加量合計値を入力してください。
              </p>
              <p>
                また、注目度が変化する "人気者", "ひかえめ" は
                <span class="bold">
                  フェスに参加している全てのユニットの値が反映される可能性があります(※未検証)
                </span>
                そのため、それらの個数を入力可能としていますが、基本的には自分のユニット内での取得個数(0〜5)を入力してください。
              </p>
              <br />
              <p>
                これらの入力した情報は、ページを閉じたり、リロードすると消えてしまいます。
                しかし、これらの情報はセーブスロットに保存することができます。
                情報入力後、好きなセーブスロットを選び、好きな名前を付けて
                "名前を付けて保存" ボタンを押すことで、
                入力内容を保存することができます。
                必要に応じて、入力内容を保存した後、ページの一番上まで戻ってください。
                (準備してあるボタンも利用可能です)
              </p>
              <img
                src="/images/usage03.jpg"
                class="img-fluid"
                alt="入力情報の保存"
              />
              <br />
              <p>
                保存した内容は、フェスユニット入力の上にあるボタンでロードすることができます。
              </p>
              <img
                src="/images/usage04.jpg"
                class="img-fluid"
                alt="入力情報の読み込み"
              />
              <br />
              <p>
                この情報はあなたのパソコン（ブラウザ）の中に保存されます。
                そのため、キャッシュをクリアしたり、別のブラウザで見るような場合、保存したデータは失われることに注意してください。
              </p>
              <br />
              <p>
                以上でフェスユニット入力の準備は終了です。
              </p>
            </b-col>
          </b-row>
          <br />
          <b-row>
            <b-col>
              <h2>2. アピール値の計算</h2>
              <p>
                ユニット情報を入力した後、"アピール値計算"
                のタブを開いてください。
                こちらで実際のアピール値の計算を行います。
              </p>
              <br />
              <p>
                フェスが始まると毎回異なる思い出ゲージでの開始となります。
                グレードフェスの場合、５種類の顔（紫、青、緑、黄色、赤）で示される通り、パターンは５種類です。
                そのため、グレードフェスの準備でテンションチェック終了後、
                あるいはフェスリハーサルの思い出ゲージの初期値で状態を初期化します。
                適切なテンションを選び、ターンの初期化ボタンを押します。
                すると、思い出ゲージとメンタルが初期化されます。
              </p>
              <img
                src="/images/usage05.jpg"
                class="img-fluid"
                alt="ターンの初期化直後"
              />
              <br />
              <p>
                次に、ターンが始まると、パッシブスキルがランダムに発動し、アピールにバフ(増加効果)が得られます。
                また、前ターンから引き継ぎの効果(アイコン)がある場合、こちらでも同様にバフが得られます。
                これらを画面に入力します。
                そして、実際に行うアピールの倍率を入力します。
              </p>
              <p>
                具体例として、２ターン目、思い出ゲージ48.5 (30開始 + 15 x
                1.25追加) の状態で、 以下の図のような効果(Vo,
                Viにそれぞれ+15%のバフ)があり、 「ほわっとスマイル＋（Vo3倍 +
                Vi3倍)」をアピールする場合を考えてみます。
                また、図から分かるとおり、Voに77%,
                Viに70%のパッシブスキルによるバフがかかっています。
              </p>
              <div class="text-center">
                <img
                  src="/images/usage06.jpg"
                  class="img-fluid"
                  alt="現在有効な効果一覧"
                />
                <img
                  src="/images/usage07.jpg"
                  class="img-fluid"
                  alt="実施する予定のアピール"
                />
              </div>
              <br />
              <p>
                この時、シミュレーターに以下の図のような入力を行います。
                なお、ここでは真乃のポジションは上の図にあるとおり "Vocal担当"
                で、 実施するアピールは "Perfect"
                としてアピールした場合のアピール値計算を行いたいものとします。
              </p>
              <img
                src="/images/usage08.jpg"
                class="img-fluid"
                alt="入力の具体例"
              />
              <br />
              <p>
                今回のDanceアピールのように、実施されないアピールについてはアピール倍率を0のままにしておいてください。
              </p>
              <p>
                この時、以下のように各審査員に対してアピールを行った時の計算結果が得られます。
              </p>
              <img
                src="/images/usage09.jpg"
                class="img-fluid"
                alt="シミュレーション結果"
              />
              <br />
              <p>
                この状態でVocal審査員にアピールした実際の結果は以下の通りです
                (まだβ版で完全な計算式が得られていないため、若干のズレがあります)。
              </p>
              <img
                src="/images/usage10.jpg"
                class="img-fluid"
                alt="実際の結果(誤差あり)"
              />
              <br />
              <p>
                なお、シミュレーション結果からも分かるように、
                G.R.A.D.のアビリティバフが実装以前と比較すると破格の効果を及ぼしていることがわかります。
              </p>
              <p>
                以上の方法で、適切にアピール時の状況を入力することでフェスでのアピール時の計算結果を事前にシミュレーションできます。
                ターン経過時の思い出増加量自動計算などの機能もありますので、こちらもご利用ください。
                (G.R.A.D.バフを算出するには、現在ターン数や現在の思い出ゲージの正確な値が必要になるためです)
              </p>
            </b-col>
          </b-row>
        </b-tab>
        <b-tab title="計算式など">
          <b-row>
            <b-col>
              <h2>利用中の計算式</h2>
              <h3>アピール値算出式</h3>
              <ul>
                <li>
                  フェスアピール基礎値 = 2.0 *
                  アピールするアイドルの該当ステータス + 0.5 *
                  (アピールしないアイドルの該当ステータス合計)
                </li>
                <li>
                  基礎係数 = INT(フェスアピール基礎値 * (1 +
                  該当属性バフ合計値(%)/100 + アビリティバフ合計値(%)/100) *
                  アピール係数)
                </li>
                <li>
                  興味値補正 = 1 * nΠi(1 + 興味UP(%)の項目i/100) * nΠi(1 -
                  興味DOWN(%)の項目i/100)
                  <ul>
                    <li>
                      興味値は個別の値の総乗(nΠi)を取る。
                      具体的には、50%ダウンと30%ダウンが同時に付いている場合は 1
                      * 0.5 * 0.7 = 0.35 となる
                    </li>
                  </ul>
                </li>
                <li>
                  フェスアピール値 = INT(INT(基礎係数 * アピール倍率) *
                  Excellent係数 * 興味値補正)
                </li>
                <li>
                  アピール係数はPerfectなら1.5, Goodなら1.1, Normarlなら1.0,
                  Badなら0.5
                </li>
                <li>
                  Excellent係数はアピール属性と審査員属性が一致した場合2,
                  一致しない場合は1
                </li>
              </ul>
              <h3>単独アビリティバフ算出式</h3>
              <ul>
                <li>
                  スタートダッシュ(%): MAX(10 - (8/9 * (現在ターン数 - 1)), 2)
                </li>
                <li>
                  スロースタート(%): MIN(4 + (16/9 * (現在ターン数 - 1)), 20)
                </li>
                <li>
                  アピールアップ(思い出高) (%): 2 + (思い出ゲージ / 100) * 8
                </li>
                <li>
                  アピールアップ(思い出低) (%): 4 + (1 - 思い出ゲージ / 100) *
                  16
                </li>
              </ul>
            </b-col>
          </b-row>
        </b-tab>
      </b-tabs>
      <br />
      <b-row>
        <b-col>
          <a
            href="https://twitter.com/share?ref_src=twsrc%5Etfw"
            class="twitter-share-button"
            data-text="シャニマス フェス計算機 - "
            data-url="https://kind-agnesi-553039.netlify.app/"
            data-lang="ja"
            data-show-count="false"
          >
            Tweet
          </a>
          <script
            async
            src="https://platform.twitter.com/widgets.js"
            charset="utf-8"
          ></script>
        </b-col>
      </b-row>

      <b-row>
        <b-col>
          <p>
            このページの情報の正当性は一切保証されません。
            また、ページ内の情報を利用したことによって生じた一切の不利益に対してページの製作者は責を負いません。
          </p>
          <p>
            ©BANDAI NAMCO Entertinment Inc. ©BXD Inc.<br />
            当ページ上で用いるゲーム画像の著作権、及びその他知的財産権は
            当該サービスの提供元に帰属します。
          </p>
          <p>
            コンタクト(バグ報告, 改善要望,
            サービス提供元からの画像削除依頼など)は
            <a href="https://twitter.com/m_kigirai" target="_blank">
              Twitter: @m_kigirai
            </a>
            もしくは
            <a
              href="https://github.com/m-kigirai/shinymas-fes-simulator-site"
              target="_blank"
            >
              Github
            </a>
            から。
          </p>
        </b-col>
      </b-row>
    </div>
  </b-container>
</template>

<script>
export default {};
</script>

<style>
.img-fluid {
  padding-bottom: 0.5em;
}
</style>
